controllers/EntradaController.php

    public function actionCreate()
    {
        $model = new ENTRADA();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `tb_entrada` (`ENTRADA_OCORRENCIA`, `EQUIPAMENTO_COD_FK`) VALUES ('LAMPADA QUEBRADA', 6)