views/entrada/index.php

    </p>

    <?php // echo $this->render('_search', ['model' => $searchModel]); ?>
    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],

            [
                'attribute' => 'ENTRADA_COD_PK',
                'value' => 'ENTRADA_COD_PK',
                'contentOptions'=>['style'=>'text-align: ; width:50px'],
            ],
            'ENTRADA_OCORRENCIA',
            [
                'attribute' => 'EQUIPAMENTO_COD_FK',
                'value' => 'EQUIPAMENTO_COD_FK',
                'format' => 'html',
                'headerOptions'=>['style'=>'text-align: center;'],
                'contentOptions'=>['style'=>'text-align: ; width:300px'],
                'filter' => \kartik\select2\Select2::widget([
                    'model'=>$searchModel,
                    'data' => ArrayHelper::map(EQUIPAMENTO::find()->asArray()->all(), 'EQUIPAMENTO_COD_PK', 'EQUIPAMENTO_NUM_SERIE'),
                    'attribute'=>'EQUIPAMENTO_COD_FK',
                    'pluginOptions'=>[
                        'placeholder'=>'- Selecione - ',
                        'allowClear' => true,
                    ]
                ]),
---
SELECT * FROM `tb_equipamento` WHERE `EQUIPAMENTO_COD_PK` IN (6, 3, 4, 5, 7, 2, 1)
SELECT * FROM `tb_equipamento`

                'format' => 'html',
                'headerOptions'=>['style'=>'text-align: center;'],
                'contentOptions'=>['style'=>'text-align: ; width:500px'],
                'filter' => \kartik\select2\Select2::widget([
                    'model'=>$searchModel,
                    'data' => ArrayHelper::map(LOCAL::find()->asArray()->all(), 'LOCAL_COD_PK', 'LOCAL_NOME'),
                    'attribute'=>'LOCAL_COD_FK',
                    'pluginOptions'=>[
                        'placeholder'=>'- Selecione - ',
                        'allowClear' => true,
                    ]
                ]),
---
SELECT * FROM `tb_local`