views/equipamento/_form.php


    <?= $form->field($model, 'EQUIPAMENTO_NUM_SERIE')->textInput(['maxlength' => true]) ?>

    <?= $form->field($model, 'LOCAL_COD_FK')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(LOCAL::find()->asArray()->all(), 'LOCAL_COD_PK', 'LOCAL_NOME'),
            'pluginOptions'=>[
                'placeholder'=>'- Selecione - ',
                'allowClear' => true,
            ]
        ]);
---
SELECT * FROM `tb_local`