views/equipamento/index.php

SELECT * FROM `tb_local` WHERE `LOCAL_COD_PK`=1
SELECT * FROM `tb_local`
---
                'headerOptions'=>['style'=>'text-align: center;'],
                'contentOptions'=>['style'=>'text-align: ; width:500px'],

                'filter' => \kartik\select2\Select2::widget([
                    'model'=>$searchModel,
                    'data' => ArrayHelper::map(LOCAL::find()->asArray()->all(), 'LOCAL_COD_PK', 'LOCAL_NOME'),
                    'attribute'=>'LOCAL_COD_FK',
                    'pluginOptions'=>[
                        'placeholder'=>'- Selecione - ',
                        'allowClear' => true,
                    ]
                ]),
                'value'=>function($data){
                    return $data->lOCALCODFK->LOCAL_NOME;
                },
            ],